[Killed] BlockStatement
modules/crm/services/duplicate-execution-service.ts:31:86
  * Pure function: is the lease still active?
  * A lease is active when the elapsed time since executedAt is less than MERGE_LEASE_MS.
  */
-export function isLeaseActive(executedAt: Date, nowMs: number = Date.now()): boolean {
-  return nowMs - executedAt.getTime() < MERGE_LEASE_MS;
-}
+export function isLeaseActive(executedAt: Date, nowMs: number = Date.now()): boolean {}
 
 // ── Owner merge dispatcher ───────────────────────────────────────────────────
killedBy: isLeaseActive returns true when elapsed < 30s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:32:10
  * A lease is active when the elapsed time since executedAt is less than MERGE_LEASE_MS.
  */
 export function isLeaseActive(executedAt: Date, nowMs: number = Date.now()): boolean {
-  return nowMs - executedAt.getTime() < MERGE_LEASE_MS;
+  return true;
 }
 
killedBy: isLeaseActive returns false when elapsed = 30s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
modules/crm/services/duplicate-execution-service.ts:32:10
  * A lease is active when the elapsed time since executedAt is less than MERGE_LEASE_MS.
  */
 export function isLeaseActive(executedAt: Date, nowMs: number = Date.now()): boolean {
-  return nowMs - executedAt.getTime() < MERGE_LEASE_MS;
+  return nowMs - executedAt.getTime() <= MERGE_LEASE_MS;
 }
 
killedBy: isLeaseActive returns false when elapsed = 30s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
modules/crm/services/duplicate-execution-service.ts:46:9
 export function registerOwnerMerge(
   ownerType: 'patient' | 'lead',
   dispatcher: OwnerMergeDispatcher,
-): void {
-  // Map.set silently overwrites — safe post-Tier-3 (only one registrant per key).
-  // If a second registrant appears later, consider throwing on duplicate key.
-  ownerMergeRegistry.set(ownerType, dispatcher);
-}
+): void {}
 
 /** Leitura de diagnóstico — exposto para guard tests. */
killedBy: CRM duplicate execution normal flow: dispatcher succeeds, finalize wins
statusReason: ActionError: Concorrência: estado alterado antes de registrar falha.

[NoCoverage] BlockStatement
modules/crm/services/duplicate-execution-service.ts:53:106
 }
 
 /** Leitura de diagnóstico — exposto para guard tests. */
-export function getOwnerMergeDispatcher(ownerType: 'patient' | 'lead'): OwnerMergeDispatcher | undefined {
-  return ownerMergeRegistry.get(ownerType);
-}
+export function getOwnerMergeDispatcher(ownerType: 'patient' | 'lead'): OwnerMergeDispatcher | undefined {}
 
 // ── Document conflict check ─────────────────────────────────────────────────

[Killed] BlockStatement
modules/crm/services/duplicate-execution-service.ts:62:12
 function hasDocumentConflict(
   leftSnapshot: Record<string, unknown>,
   rightSnapshot: Record<string, unknown>,
-): boolean {
-  const leftDoc = (leftSnapshot?.document as string) ?? '';
-  const rightDoc = (rightSnapshot?.document as string) ?? '';
-  return Boolean(leftDoc && rightDoc && leftDoc !== rightDoc);
-}
+): boolean {}
 
 function detectMaterialDrift(storedScore: number, refreshScore: number): boolean {
killedBy: CRM duplicate execution rejects merge when document conflict exists
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: {"id": "00000000-0000-4000-8000-000000000010", "status": "executing"}

[Killed] LogicalOperator
modules/crm/services/duplicate-execution-service.ts:63:19
   leftSnapshot: Record<string, unknown>,
   rightSnapshot: Record<string, unknown>,
 ): boolean {
-  const leftDoc = (leftSnapshot?.document as string) ?? '';
+  const leftDoc = leftSnapshot?.document as string && '';
   const rightDoc = (rightSnapshot?.document as string) ?? '';
   return Boolean(leftDoc && rightDoc && leftDoc !== rightDoc);
killedBy: CRM duplicate execution rejects merge when document conflict exists
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: {"id": "00000000-0000-4000-8000-000000000010", "status": "executing"}

[Killed] LogicalOperator
modules/crm/services/duplicate-execution-service.ts:64:20
   rightSnapshot: Record<string, unknown>,
 ): boolean {
   const leftDoc = (leftSnapshot?.document as string) ?? '';
-  const rightDoc = (rightSnapshot?.document as string) ?? '';
+  const rightDoc = rightSnapshot?.document as string && '';
   return Boolean(leftDoc && rightDoc && leftDoc !== rightDoc);
 }
killedBy: CRM duplicate execution rejects merge when document conflict exists
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: {"id": "00000000-0000-4000-8000-000000000010", "status": "executing"}

[Killed] StringLiteral
modules/crm/services/duplicate-execution-service.ts:64:59
   rightSnapshot: Record<string, unknown>,
 ): boolean {
   const leftDoc = (leftSnapshot?.document as string) ?? '';
-  const rightDoc = (rightSnapshot?.document as string) ?? '';
+  const rightDoc = (rightSnapshot?.document as string) ?? "Stryker was here!";
   return Boolean(leftDoc && rightDoc && leftDoc !== rightDoc);
 }
killedBy: CRM duplicate execution no conflict when only one side has a document
statusReason: ActionError: Conflito de documento entre registros.

[Killed] LogicalOperator
modules/crm/services/duplicate-execution-service.ts:65:18
 ): boolean {
   const leftDoc = (leftSnapshot?.document as string) ?? '';
   const rightDoc = (rightSnapshot?.document as string) ?? '';
-  return Boolean(leftDoc && rightDoc && leftDoc !== rightDoc);
+  return Boolean(leftDoc || rightDoc && leftDoc !== rightDoc);
 }
 
killedBy: CRM duplicate execution no conflict when only one side has a document
statusReason: ActionError: Conflito de documento entre registros.

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:65:18
 ): boolean {
   const leftDoc = (leftSnapshot?.document as string) ?? '';
   const rightDoc = (rightSnapshot?.document as string) ?? '';
-  return Boolean(leftDoc && rightDoc && leftDoc !== rightDoc);
+  return Boolean(true);
 }
 
killedBy: CRM duplicate execution normal flow: dispatcher succeeds, finalize wins
statusReason: ActionError: Conflito de documento entre registros.

[Killed] BlockStatement
modules/crm/services/duplicate-execution-service.ts:68:82
   return Boolean(leftDoc && rightDoc && leftDoc !== rightDoc);
 }
 
-function detectMaterialDrift(storedScore: number, refreshScore: number): boolean {
-  return Math.abs(storedScore - refreshScore) >= 15;
-}
+function detectMaterialDrift(storedScore: number, refreshScore: number): boolean {}
 
 // ── Main merge execution ────────────────────────────────────────────────────
killedBy: CRM duplicate execution returns pending when material drift detected (>= 15)
statusReason: ActionError: Concorrência: merge já finalizado.

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:69:10
 }
 
 function detectMaterialDrift(storedScore: number, refreshScore: number): boolean {
-  return Math.abs(storedScore - refreshScore) >= 15;
+  return true;
 }
 
killedBy: CRM duplicate execution normal flow: dispatcher succeeds, finalize wins
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
-   "status": "executing",
+   "status": "pending",

[Killed] EqualityOperator
modules/crm/services/duplicate-execution-service.ts:69:10
 }
 
 function detectMaterialDrift(storedScore: number, refreshScore: number): boolean {
-  return Math.abs(storedScore - refreshScore) >= 15;
+  return Math.abs(storedScore - refreshScore) < 15;
 }
 
killedBy: CRM duplicate execution normal flow: dispatcher succeeds, finalize wins
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
-   "status": "executing",
+   "status": "pending",

[Killed] BooleanLiteral
modules/crm/services/duplicate-execution-service.ts:80:7
   ctx: ActionContext,
 ) {
   const suggestion = await findSuggestionById(ctx.clinicId, id);
-  if (!suggestion) throw new ActionError('not_found', 'Sugestão não encontrada.');
+  if (suggestion) throw new ActionError('not_found', 'Sugestão não encontrada.');
 
   // ── Recovery path: suggestion is 'executing' with possibly stale lease ──
killedBy: CRM duplicate execution applied recovery: finalizes without dispatcher when owner merge already applied
statusReason: ActionError: Sugestão não encontrada.

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:80:7
   ctx: ActionContext,
 ) {
   const suggestion = await findSuggestionById(ctx.clinicId, id);
-  if (!suggestion) throw new ActionError('not_found', 'Sugestão não encontrada.');
+  if (true) throw new ActionError('not_found', 'Sugestão não encontrada.');
 
   // ── Recovery path: suggestion is 'executing' with possibly stale lease ──
killedBy: CRM duplicate execution applied recovery: finalizes without dispatcher when owner merge already applied
statusReason: ActionError: Sugestão não encontrada.

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:83:7
   if (!suggestion) throw new ActionError('not_found', 'Sugestão não encontrada.');
 
   // ── Recovery path: suggestion is 'executing' with possibly stale lease ──
-  if (suggestion.status === 'executing') {
+  if (true) {
     if (suggestion.executedAt && isLeaseActive(suggestion.executedAt)) {
       throw new ActionError('conflict', 'Concorrência: merge em execução por outro processo.');
killedBy: CRM duplicate execution normal flow: dispatcher succeeds, finalize wins
statusReason: ActionError: Concorrência: estado alterado antes de liberar lease.

[Killed] EqualityOperator
modules/crm/services/duplicate-execution-service.ts:83:7
   if (!suggestion) throw new ActionError('not_found', 'Sugestão não encontrada.');
 
   // ── Recovery path: suggestion is 'executing' with possibly stale lease ──
-  if (suggestion.status === 'executing') {
+  if (suggestion.status !== 'executing') {
     if (suggestion.executedAt && isLeaseActive(suggestion.executedAt)) {
       throw new ActionError('conflict', 'Concorrência: merge em execução por outro processo.');
killedBy: CRM duplicate execution applied recovery: finalizes without dispatcher when owner merge already applied
statusReason: ActionError: Sugestão não aprovada.

[Killed] BlockStatement
modules/crm/services/duplicate-execution-service.ts:84:72
 
   // ── Recovery path: suggestion is 'executing' with possibly stale lease ──
   if (suggestion.status === 'executing') {
-    if (suggestion.executedAt && isLeaseActive(suggestion.executedAt)) {
-      throw new ActionError('conflict', 'Concorrência: merge em execução por outro processo.');
-    }
+    if (suggestion.executedAt && isLeaseActive(suggestion.executedAt)) {}
     // Lease expired — check if owner merge already applied
     const merged = ownerType === 'patient'
killedBy: CRM duplicate execution active lease: throws conflict without marking failed
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 1
+ Received  + 0

  Object {
    "code": "conflict",
-   "message": "Concorrência: merge em execução por outro processo.",

[Killed] LogicalOperator
modules/crm/services/duplicate-execution-service.ts:84:9
 
   // ── Recovery path: suggestion is 'executing' with possibly stale lease ──
   if (suggestion.status === 'executing') {
-    if (suggestion.executedAt && isLeaseActive(suggestion.executedAt)) {
+    if (suggestion.executedAt || isLeaseActive(suggestion.executedAt)) {
       throw new ActionError('conflict', 'Concorrência: merge em execução por outro processo.');
     }
killedBy: CRM duplicate execution applied recovery: finalizes without dispatcher when owner merge already applied
statusReason: ActionError: Concorrência: merge em execução por outro processo.

[Killed] StringLiteral
modules/crm/services/duplicate-execution-service.ts:85:29
   // ── Recovery path: suggestion is 'executing' with possibly stale lease ──
   if (suggestion.status === 'executing') {
     if (suggestion.executedAt && isLeaseActive(suggestion.executedAt)) {
-      throw new ActionError('conflict', 'Concorrência: merge em execução por outro processo.');
+      throw new ActionError("", 'Concorrência: merge em execução por outro processo.');
     }
     // Lease expired — check if owner merge already applied
killedBy: CRM duplicate execution active lease: throws conflict without marking failed
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 2
+ Received  + 1

  Object {
-   "code": "conflict",
-   "message": "Concorrência: merge em execução por outro processo.",

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:88:20
       throw new ActionError('conflict', 'Concorrência: merge em execução por outro processo.');
     }
     // Lease expired — check if owner merge already applied
-    const merged = ownerType === 'patient'
+    const merged = false
       ? await isPatientMerged(suggestion.leftId, ctx.clinicId)
       : await isLeadMerged(suggestion.leftId, ctx.clinicId);
killedBy: CRM duplicate execution applied recovery: finalizes without dispatcher when owner merge already applied
statusReason: ActionError: Concorrência: estado alterado antes de liberar lease.

[Killed] EqualityOperator
modules/crm/services/duplicate-execution-service.ts:88:20
       throw new ActionError('conflict', 'Concorrência: merge em execução por outro processo.');
     }
     // Lease expired — check if owner merge already applied
-    const merged = ownerType === 'patient'
+    const merged = ownerType !== 'patient'
       ? await isPatientMerged(suggestion.leftId, ctx.clinicId)
       : await isLeadMerged(suggestion.leftId, ctx.clinicId);
killedBy: CRM duplicate execution applied recovery: finalizes without dispatcher when owner merge already applied
statusReason: ActionError: Concorrência: estado alterado antes de liberar lease.

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:92:9
       ? await isPatientMerged(suggestion.leftId, ctx.clinicId)
       : await isLeadMerged(suggestion.leftId, ctx.clinicId);
 
-    if (merged) {
+    if (true) {
       // Applied recovery: finalize exactly once WITHOUT dispatcher
       const finalized = await finalizeMergeAndDismissSiblings(
killedBy: CRM duplicate execution unapplied recovery: marks failed and throws retry-able conflict (unexpected state)
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 1
+ Received  + 0

  Object {
    "code": "conflict",
-   "message": "Recuperação: estado inesperado após liberar lease.",

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:92:9
       ? await isPatientMerged(suggestion.leftId, ctx.clinicId)
       : await isLeadMerged(suggestion.leftId, ctx.clinicId);
 
-    if (merged) {
+    if (false) {
       // Applied recovery: finalize exactly once WITHOUT dispatcher
       const finalized = await finalizeMergeAndDismissSiblings(
killedBy: CRM duplicate execution applied recovery: finalizes without dispatcher when owner merge already applied
statusReason: ActionError: Concorrência: estado alterado antes de liberar lease.

[Survived] LogicalOperator
modules/crm/services/duplicate-execution-service.ts:96:9
       // Applied recovery: finalize exactly once WITHOUT dispatcher
       const finalized = await finalizeMergeAndDismissSiblings(
         id,
-        suggestion.mergeOperationKey ?? '',
+        suggestion.mergeOperationKey && '',
         ctx.clinicId,
         suggestion.leftId,

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:102:11
         suggestion.rightId,
         ownerType,
       );
-      if (!finalized) {
+      if (false) {
         // CAS loss — another process already finalized
         const updated = await findSuggestionById(ctx.clinicId, id);
killedBy: CRM duplicate execution applied recovery: CAS loss rereads merged and returns idempotent
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:102:11
         suggestion.rightId,
         ownerType,
       );
-      if (!finalized) {
+      if (true) {
         // CAS loss — another process already finalized
         const updated = await findSuggestionById(ctx.clinicId, id);
killedBy: CRM duplicate execution applied recovery: finalizes without dispatcher when owner merge already applied
statusReason: ActionError: Concorrência: merge já finalizado.

[Killed] BlockStatement
modules/crm/services/duplicate-execution-service.ts:105:43
       if (!finalized) {
         // CAS loss — another process already finalized
         const updated = await findSuggestionById(ctx.clinicId, id);
-        if (updated?.status === 'merged') {
-          return { id, status: 'merged' };
-        }
+        if (updated?.status === 'merged') {}
         throw new ActionError('conflict', 'Concorrência: merge já finalizado.');
       }
killedBy: CRM duplicate execution applied recovery: CAS loss rereads merged and returns idempotent
statusReason: ActionError: Concorrência: merge já finalizado.

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:105:13
       if (!finalized) {
         // CAS loss — another process already finalized
         const updated = await findSuggestionById(ctx.clinicId, id);
-        if (updated?.status === 'merged') {
+        if (false) {
           return { id, status: 'merged' };
         }
killedBy: CRM duplicate execution applied recovery: CAS loss rereads merged and returns idempotent
statusReason: ActionError: Concorrência: merge já finalizado.

[Killed] StringLiteral
modules/crm/services/duplicate-execution-service.ts:110:28
         }
         throw new ActionError('conflict', 'Concorrência: merge já finalizado.');
       }
-      return { id, status: 'merged' };
+      return { id, status: "" };
     }
 
killedBy: CRM duplicate execution applied recovery: finalizes without dispatcher when owner merge already applied
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
-   "status": "merged",
+   "status": "",

[Killed] LogicalOperator
modules/crm/services/duplicate-execution-service.ts:118:7
     const failed = await markSuggestionFailed(
       id,
       ctx.clinicId,
-      suggestion.mergeOperationKey ?? '',
+      suggestion.mergeOperationKey && '',
       'lease_expired_recovery',
     );
killedBy: CRM duplicate execution unapplied recovery: marks failed and throws retry-able conflict (unexpected state)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "00000000-0000-4000-8000-000000000010", "00000000-0000-4000-8000-000000000001", "key-stale", "lease_expired_recovery"
Received: "00000000-0000-4000-8000-000000000010", "00000000-0000-4000-8000-000000000001", "", "lease_expired_recovery"

Number of calls: 1

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:121:9
       suggestion.mergeOperationKey ?? '',
       'lease_expired_recovery',
     );
-    if (!failed) {
+    if (true) {
       // CAS loss — another process already finalized/merged this suggestion
       const updated = await findSuggestionById(ctx.clinicId, id);
killedBy: CRM duplicate execution unapplied recovery: marks failed and throws retry-able conflict (unexpected state)
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 1
+ Received  + 0

  Object {
    "code": "conflict",
-   "message": "Recuperação: estado inesperado após liberar lease.",

[Killed] BlockStatement
modules/crm/services/duplicate-execution-service.ts:121:18
       suggestion.mergeOperationKey ?? '',
       'lease_expired_recovery',
     );
-    if (!failed) {
-      // CAS loss — another process already finalized/merged this suggestion
-      const updated = await findSuggestionById(ctx.clinicId, id);
-      if (updated?.status === 'merged') {
-        return { id, status: 'merged' }; // idempotent merged outcome
-      }
-      throw new ActionError('conflict', 'Concorrência: estado alterado antes de liberar lease.');
-    }
+    if (!failed) {}
     // Then re-read the suggestion (now 'failed') and flow through to re-claim
     const refreshed = await findSuggestionById(ctx.clinicId, id);
killedBy: CRM duplicate execution unapplied recovery: CAS loss rereads merged and returns idempotent
statusReason: ActionError: Recuperação: estado inesperado após liberar lease.

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:124:11
     if (!failed) {
       // CAS loss — another process already finalized/merged this suggestion
       const updated = await findSuggestionById(ctx.clinicId, id);
-      if (updated?.status === 'merged') {
+      if (true) {
         return { id, status: 'merged' }; // idempotent merged outcome
       }
killedBy: CRM duplicate execution unapplied recovery: CAS loss reread not merged throws conflict
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: {"id": "00000000-0000-4000-8000-000000000010", "status": "merged"}

[Killed] BlockStatement
modules/crm/services/duplicate-execution-service.ts:124:41
     if (!failed) {
       // CAS loss — another process already finalized/merged this suggestion
       const updated = await findSuggestionById(ctx.clinicId, id);
-      if (updated?.status === 'merged') {
-        return { id, status: 'merged' }; // idempotent merged outcome
-      }
+      if (updated?.status === 'merged') {}
       throw new ActionError('conflict', 'Concorrência: estado alterado antes de liberar lease.');
     }
killedBy: CRM duplicate execution unapplied recovery: CAS loss rereads merged and returns idempotent
statusReason: ActionError: Concorrência: estado alterado antes de liberar lease.

[Killed] StringLiteral
modules/crm/services/duplicate-execution-service.ts:125:30
       // CAS loss — another process already finalized/merged this suggestion
       const updated = await findSuggestionById(ctx.clinicId, id);
       if (updated?.status === 'merged') {
-        return { id, status: 'merged' }; // idempotent merged outcome
+        return { id, status: "" }; // idempotent merged outcome
       }
       throw new ActionError('conflict', 'Concorrência: estado alterado antes de liberar lease.');
killedBy: CRM duplicate execution unapplied recovery: CAS loss rereads merged and returns idempotent
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
-   "status": "merged",
+   "status": "",

[Killed] StringLiteral
modules/crm/services/duplicate-execution-service.ts:127:29
       if (updated?.status === 'merged') {
         return { id, status: 'merged' }; // idempotent merged outcome
       }
-      throw new ActionError('conflict', 'Concorrência: estado alterado antes de liberar lease.');
+      throw new ActionError("", 'Concorrência: estado alterado antes de liberar lease.');
     }
     // Then re-read the suggestion (now 'failed') and flow through to re-claim
killedBy: CRM duplicate execution unapplied recovery: CAS loss reread not merged throws conflict
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 2
+ Received  + 1

  Object {
-   "code": "conflict",
-   "message": "Concorrência: estado alterado antes de liberar lease.",

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:131:23
     }
     // Then re-read the suggestion (now 'failed') and flow through to re-claim
     const refreshed = await findSuggestionById(ctx.clinicId, id);
-    if (!refreshed || refreshed.status !== 'failed') {
+    if (!refreshed || false) {
       throw new ActionError('conflict', 'Recuperação: estado inesperado após liberar lease.');
     }
killedBy: CRM duplicate execution unapplied recovery: marks failed and throws retry-able conflict (unexpected state)
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 1
+ Received  + 0

  Object {
    "code": "conflict",
-   "message": "Recuperação: estado inesperado após liberar lease.",

[Killed] EqualityOperator
modules/crm/services/duplicate-execution-service.ts:131:23
     }
     // Then re-read the suggestion (now 'failed') and flow through to re-claim
     const refreshed = await findSuggestionById(ctx.clinicId, id);
-    if (!refreshed || refreshed.status !== 'failed') {
+    if (!refreshed || refreshed.status === 'failed') {
       throw new ActionError('conflict', 'Recuperação: estado inesperado após liberar lease.');
     }
killedBy: CRM duplicate execution unapplied recovery: marks failed and throws retry-able conflict (unexpected state)
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 1
+ Received  + 0

  Object {
    "code": "conflict",
-   "message": "Recuperação: estado inesperado após liberar lease.",

[Killed] StringLiteral
modules/crm/services/duplicate-execution-service.ts:132:29
     // Then re-read the suggestion (now 'failed') and flow through to re-claim
     const refreshed = await findSuggestionById(ctx.clinicId, id);
     if (!refreshed || refreshed.status !== 'failed') {
-      throw new ActionError('conflict', 'Recuperação: estado inesperado após liberar lease.');
+      throw new ActionError("", 'Recuperação: estado inesperado após liberar lease.');
     }
     // Fall through to throw a retry-able error so the caller re-claims.
killedBy: CRM duplicate execution unapplied recovery: marks failed and throws retry-able conflict (unexpected state)
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 2
+ Received  + 1

  Object {
-   "code": "conflict",
-   "message": "Recuperação: estado inesperado após liberar lease.",

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:138:7
     throw new ActionError('conflict', 'Lease expirado. Reivindique novamente.');
   }
 
-  if (suggestion.status !== 'approved') {
+  if (true) {
     throw new ActionError('conflict', 'Sugestão não aprovada.');
   }
killedBy: CRM duplicate execution normal flow: dispatcher succeeds, finalize wins
statusReason: ActionError: Sugestão não aprovada.

[Killed] EqualityOperator
modules/crm/services/duplicate-execution-service.ts:138:7
     throw new ActionError('conflict', 'Lease expirado. Reivindique novamente.');
   }
 
-  if (suggestion.status !== 'approved') {
+  if (suggestion.status === 'approved') {
     throw new ActionError('conflict', 'Sugestão não aprovada.');
   }
killedBy: CRM duplicate execution normal flow: dispatcher succeeds, finalize wins
statusReason: ActionError: Sugestão não aprovada.

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:142:7
     throw new ActionError('conflict', 'Sugestão não aprovada.');
   }
 
-  if (hasDocumentConflict(
-    suggestion.leftSnapshot as any,
-    suggestion.rightSnapshot as any,
-  )) {
+  if (true) {
     throw new ActionError('conflict', 'Conflito de documento entre registros.');
   }
killedBy: CRM duplicate execution normal flow: dispatcher succeeds, finalize wins
statusReason: ActionError: Conflito de documento entre registros.

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:142:7
     throw new ActionError('conflict', 'Sugestão não aprovada.');
   }
 
-  if (hasDocumentConflict(
-    suggestion.leftSnapshot as any,
-    suggestion.rightSnapshot as any,
-  )) {
+  if (false) {
     throw new ActionError('conflict', 'Conflito de documento entre registros.');
   }
killedBy: CRM duplicate execution rejects merge when document conflict exists
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: {"id": "00000000-0000-4000-8000-000000000010", "status": "executing"}

[Killed] BlockStatement
modules/crm/services/duplicate-execution-service.ts:145:6
   if (hasDocumentConflict(
     suggestion.leftSnapshot as any,
     suggestion.rightSnapshot as any,
-  )) {
-    throw new ActionError('conflict', 'Conflito de documento entre registros.');
-  }
+  )) {}
 
   const source = await findDuplicateSource({
killedBy: CRM duplicate execution rejects merge when document conflict exists
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 2
+ Received  + 1

  Object {
-   "code": "conflict",
-   "message": "Conflito de documento entre registros.",

[Killed] BooleanLiteral
modules/crm/services/duplicate-execution-service.ts:159:18
     ownerType,
     ownerId: suggestion.rightId,
   });
-  if (!source || !candidate) {
+  if (!source || candidate) {
     throw new ActionError('not_found', 'Registros de origem não encontrados.');
   }
killedBy: CRM duplicate execution normal flow: dispatcher succeeds, finalize wins
statusReason: ActionError: Registros de origem não encontrados.
