[Killed] BlockStatement
modules/crm/services/duplicate-execution-service.ts:159:30
     ownerType,
     ownerId: suggestion.rightId,
   });
-  if (!source || !candidate) {
-    throw new ActionError('not_found', 'Registros de origem não encontrados.');
-  }
+  if (!source || !candidate) {}
 
   const scoreResult = scoreDuplicatePair(source, candidate);
killedBy: CRM duplicate execution throws not_found when source or candidate missing
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 2
+ Received  + 1

  Object {
-   "code": "not_found",
-   "message": "Registros de origem não encontrados.",

[Killed] BlockStatement
modules/crm/services/duplicate-execution-service.ts:166:20
   const scoreResult = scoreDuplicatePair(source, candidate);
   const confidence = classifyDuplicateScore(scoreResult.score);
 
-  if (!confidence) {
-    await getDb()
-      .update(crmDuplicateSuggestions)
-      .set({
-        status: 'dismissed',
-        dismissReason: 'score_below_threshold_before_execution',
-        updatedAt: new Date(),
-      } as any)
-      .where(and(
-        eq(crmDuplicateSuggestions.id, id),
-        eq(crmDuplicateSuggestions.status, 'approved'),
-      ));
-    throw new ActionError('conflict', 'Score abaixo do limiar. Sugestão dispensada.');
-  }
+  if (!confidence) {}
 
   if (detectMaterialDrift(suggestion.duplicateScore, scoreResult.score)) {
killedBy: CRM duplicate execution dismisses and throws conflict when confidence below threshold
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: {"id": "00000000-0000-4000-8000-000000000010", "status": "pending"}

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:166:7
   const scoreResult = scoreDuplicatePair(source, candidate);
   const confidence = classifyDuplicateScore(scoreResult.score);
 
-  if (!confidence) {
+  if (false) {
     await getDb()
       .update(crmDuplicateSuggestions)
killedBy: CRM duplicate execution dismisses and throws conflict when confidence below threshold
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: {"id": "00000000-0000-4000-8000-000000000010", "status": "pending"}

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:181:7
     throw new ActionError('conflict', 'Score abaixo do limiar. Sugestão dispensada.');
   }
 
-  if (detectMaterialDrift(suggestion.duplicateScore, scoreResult.score)) {
+  if (false) {
     await getDb()
       .update(crmDuplicateSuggestions)
killedBy: CRM duplicate execution returns pending when material drift detected (>= 15)
statusReason: ActionError: Concorrência: merge já finalizado.

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:181:7
     throw new ActionError('conflict', 'Score abaixo do limiar. Sugestão dispensada.');
   }
 
-  if (detectMaterialDrift(suggestion.duplicateScore, scoreResult.score)) {
+  if (true) {
     await getDb()
       .update(crmDuplicateSuggestions)
killedBy: CRM duplicate execution normal flow: dispatcher succeeds, finalize wins
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
-   "status": "executing",
+   "status": "pending",

[Survived] StringLiteral
modules/crm/services/duplicate-execution-service.ts:190:44
       } as any)
       .where(and(
         eq(crmDuplicateSuggestions.id, id),
-        eq(crmDuplicateSuggestions.status, 'approved'),
+        eq(crmDuplicateSuggestions.status, ""),
       ));
     return { id, status: 'pending' };

[Killed] ObjectLiteral
modules/crm/services/duplicate-execution-service.ts:192:12
         eq(crmDuplicateSuggestions.id, id),
         eq(crmDuplicateSuggestions.status, 'approved'),
       ));
-    return { id, status: 'pending' };
+    return {};
   }
 
killedBy: CRM duplicate execution returns pending when material drift detected (>= 15)
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 4
+ Received  + 1

- Object {
-   "id": "00000000-0000-4000-8000-000000000010",
-   "status": "pending",

[Killed] StringLiteral
modules/crm/services/duplicate-execution-service.ts:196:29
   }
 
   // ── Claim with CAS ───────────────────────────────────────────────────────
-  const mergeOperationKey = `merge-${randomUUID()}`;
+  const mergeOperationKey = ``;
   const claimed = await claimSuggestion(id, ctx.clinicId, mergeOperationKey, ctx.user?.id);
   if (!claimed) {
killedBy: CRM duplicate execution normal flow: dispatcher succeeds, finalize wins
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: StringMatching /^merge-/
Received: ""

[Killed] OptionalChaining
modules/crm/services/duplicate-execution-service.ts:197:78
 
   // ── Claim with CAS ───────────────────────────────────────────────────────
   const mergeOperationKey = `merge-${randomUUID()}`;
-  const claimed = await claimSuggestion(id, ctx.clinicId, mergeOperationKey, ctx.user?.id);
+  const claimed = await claimSuggestion(id, ctx.clinicId, mergeOperationKey, ctx.user.id);
   if (!claimed) {
     throw new ActionError('conflict', 'Concorrência: sugestão alterada.');
killedBy: CRM duplicate execution handles context without user when claiming
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:198:7
   // ── Claim with CAS ───────────────────────────────────────────────────────
   const mergeOperationKey = `merge-${randomUUID()}`;
   const claimed = await claimSuggestion(id, ctx.clinicId, mergeOperationKey, ctx.user?.id);
-  if (!claimed) {
+  if (false) {
     throw new ActionError('conflict', 'Concorrência: sugestão alterada.');
   }
killedBy: CRM duplicate execution throws conflict when claim (CAS) fails
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 1
+ Received  + 0

  Object {
    "code": "conflict",
-   "message": "Concorrência: sugestão alterada.",

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:198:7
   // ── Claim with CAS ───────────────────────────────────────────────────────
   const mergeOperationKey = `merge-${randomUUID()}`;
   const claimed = await claimSuggestion(id, ctx.clinicId, mergeOperationKey, ctx.user?.id);
-  if (!claimed) {
+  if (true) {
     throw new ActionError('conflict', 'Concorrência: sugestão alterada.');
   }
killedBy: CRM duplicate execution normal flow: dispatcher succeeds, finalize wins
statusReason: ActionError: Concorrência: sugestão alterada.

[Killed] LogicalOperator
modules/crm/services/duplicate-execution-service.ts:202:20
     throw new ActionError('conflict', 'Concorrência: sugestão alterada.');
   }
 
-  const winnerId = suggestion.winnerSuggestedId ?? suggestion.leftId;
+  const winnerId = suggestion.winnerSuggestedId && suggestion.leftId;
   const loserId = winnerId === suggestion.leftId ? suggestion.rightId : suggestion.leftId;
 
killedBy: CRM duplicate execution normal flow: honors winnerSuggestedId for winner/loser selection
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "00000000-0000-4000-8000-000000000010", StringMatching /^merge-/, "00000000-0000-4000-8000-000000000001", "9acddc8d-4966-4026-adbe-6aa89f0610de", "9551a668-9e5f-45dd-a6ae-51e66a33ece2", "patient"
Received: "00000000-0000-4000-8000-000000000010", "merge-bb7dcb75-bc4d-4fd0-9599-428acc1342a8", "00000000-0000-4000-8000-000000000001"

[Killed] EqualityOperator
modules/crm/services/duplicate-execution-service.ts:203:19
   }
 
   const winnerId = suggestion.winnerSuggestedId ?? suggestion.leftId;
-  const loserId = winnerId === suggestion.leftId ? suggestion.rightId : suggestion.leftId;
+  const loserId = winnerId !== suggestion.leftId ? suggestion.rightId : suggestion.leftId;
 
   // ── Dispatch owner merge ─────────────────────────────────────────────────
killedBy: CRM duplicate execution normal flow: honors winnerSuggestedId for winner/loser selection
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "00000000-0000-4000-8000-000000000010", StringMatching /^merge-/, "00000000-0000-4000-8000-000000000001", "e3e5d06b-9c1a-40ff-9956-1b21ac293c23", "174863b4-473f-440c-a7c9-88792adc2e6b", "patient"
Received: "00000000-0000-4000-8000-000000000010", "merge-a55ced8b-27af-441c-bd85-433e60ff244d", "00000000-0000-4000-8000-000000000001"

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:203:19
   }
 
   const winnerId = suggestion.winnerSuggestedId ?? suggestion.leftId;
-  const loserId = winnerId === suggestion.leftId ? suggestion.rightId : suggestion.leftId;
+  const loserId = true ? suggestion.rightId : suggestion.leftId;
 
   // ── Dispatch owner merge ─────────────────────────────────────────────────
killedBy: CRM duplicate execution normal flow: honors winnerSuggestedId for winner/loser selection
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "00000000-0000-4000-8000-000000000010", StringMatching /^merge-/, "00000000-0000-4000-8000-000000000001", "e54607cc-1903-456c-ade3-ad8678f8fd88", "beb78556-77ae-4fd3-bb17-d1eaf8ec8e31", "patient"
Received: "00000000-0000-4000-8000-000000000010", "merge-09288472-0bf3-4b52-a256-c0107574426f", "00000000-0000-4000-8000-000000000001"

[Killed] BooleanLiteral
modules/crm/services/duplicate-execution-service.ts:207:22
 
   // ── Dispatch owner merge ─────────────────────────────────────────────────
   const dispatcher = ownerMergeRegistry.get(ownerType);
-  let ownerSuccess = false;
+  let ownerSuccess = true;
   if (dispatcher) {
     try {
killedBy: CRM duplicate execution no registered dispatcher → marks failed and throws internal
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 2
+ Received  + 1

  Object {
-   "code": "internal",
-   "message": "Falha na execução do merge pelo owner.",

[Killed] BlockStatement
modules/crm/services/duplicate-execution-service.ts:208:19
   // ── Dispatch owner merge ─────────────────────────────────────────────────
   const dispatcher = ownerMergeRegistry.get(ownerType);
   let ownerSuccess = false;
-  if (dispatcher) {
-    try {
-      ownerSuccess = await dispatcher(winnerId, loserId, ctx.clinicId);
-    } catch {
-      ownerSuccess = false;
-    }
-  }
+  if (dispatcher) {}
 
   if (ownerSuccess) {
killedBy: CRM duplicate execution normal flow: dispatcher succeeds, finalize wins
statusReason: ActionError: Concorrência: estado alterado antes de registrar falha.

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:208:7
   // ── Dispatch owner merge ─────────────────────────────────────────────────
   const dispatcher = ownerMergeRegistry.get(ownerType);
   let ownerSuccess = false;
-  if (dispatcher) {
+  if (false) {
     try {
       ownerSuccess = await dispatcher(winnerId, loserId, ctx.clinicId);
killedBy: CRM duplicate execution normal flow: dispatcher succeeds, finalize wins
statusReason: ActionError: Concorrência: estado alterado antes de registrar falha.

[Killed] BlockStatement
modules/crm/services/duplicate-execution-service.ts:209:9
   const dispatcher = ownerMergeRegistry.get(ownerType);
   let ownerSuccess = false;
   if (dispatcher) {
-    try {
-      ownerSuccess = await dispatcher(winnerId, loserId, ctx.clinicId);
-    } catch {
+    try {} catch {
       ownerSuccess = false;
     }
killedBy: CRM duplicate execution normal flow: dispatcher succeeds, finalize wins
statusReason: ActionError: Concorrência: estado alterado antes de registrar falha.

[Survived] BlockStatement
modules/crm/services/duplicate-execution-service.ts:211:13
   if (dispatcher) {
     try {
       ownerSuccess = await dispatcher(winnerId, loserId, ctx.clinicId);
-    } catch {
-      ownerSuccess = false;
-    }
+    } catch {}
   }
 

[Killed] BooleanLiteral
modules/crm/services/duplicate-execution-service.ts:212:22
     try {
       ownerSuccess = await dispatcher(winnerId, loserId, ctx.clinicId);
     } catch {
-      ownerSuccess = false;
+      ownerSuccess = true;
     }
   }
killedBy: CRM duplicate execution dispatcher error → marks failed and throws internal
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 2
+ Received  + 1

  Object {
-   "code": "internal",
-   "message": "Falha na execução do merge pelo owner.",

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:216:7
     }
   }
 
-  if (ownerSuccess) {
+  if (true) {
     // ── Atomic finalize + dismiss siblings ─────────────────────────────────
     const finalized = await finalizeMergeAndDismissSiblings(
killedBy: CRM duplicate execution failure CAS loss: rereads merged and returns idempotent
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:216:7
     }
   }
 
-  if (ownerSuccess) {
+  if (false) {
     // ── Atomic finalize + dismiss siblings ─────────────────────────────────
     const finalized = await finalizeMergeAndDismissSiblings(
killedBy: CRM duplicate execution normal flow: dispatcher succeeds, finalize wins
statusReason: ActionError: Concorrência: estado alterado antes de registrar falha.

[Killed] BlockStatement
modules/crm/services/duplicate-execution-service.ts:226:21
       loserId,
       ownerType,
     );
-    if (!finalized) {
-      // CAS failed — reread to determine outcome
-      const updated = await findSuggestionById(ctx.clinicId, id);
-      if (updated?.status === 'merged') {
-        return { id, status: 'merged' }; // idempotent merged outcome
-      }
-      throw new ActionError('conflict', 'Concorrência: merge já finalizado.');
-    }
+    if (!finalized) {}
   } else {
     // ── Mark failed with CAS ───────────────────────────────────────────────
killedBy: CRM duplicate execution finalize CAS loss: rereads merged and returns idempotent
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
-   "status": "merged",
+   "status": "executing",

[Killed] EqualityOperator
modules/crm/services/duplicate-execution-service.ts:229:11
     if (!finalized) {
       // CAS failed — reread to determine outcome
       const updated = await findSuggestionById(ctx.clinicId, id);
-      if (updated?.status === 'merged') {
+      if (updated?.status !== 'merged') {
         return { id, status: 'merged' }; // idempotent merged outcome
       }
killedBy: CRM duplicate execution finalize CAS loss: rereads merged and returns idempotent
statusReason: ActionError: Concorrência: merge já finalizado.

[Killed] BlockStatement
modules/crm/services/duplicate-execution-service.ts:234:10
       }
       throw new ActionError('conflict', 'Concorrência: merge já finalizado.');
     }
-  } else {
-    // ── Mark failed with CAS ───────────────────────────────────────────────
-    const failed = await markSuggestionFailed(id, ctx.clinicId, mergeOperationKey, 'owner_merge_failed');
-    if (!failed) {
-      // Failure CAS lost — reread to determine outcome
-      const updated = await findSuggestionById(ctx.clinicId, id);
-      if (updated?.status === 'merged') {
-        return { id, status: 'merged' };
-      }
-      throw new ActionError('conflict', 'Concorrência: estado alterado antes de registrar falha.');
-    }
-    throw new ActionError('internal', 'Falha na execução do merge pelo owner.');
-  }
+  } else {}
 
   return { id, status: 'executing' };
killedBy: CRM duplicate execution failure CAS loss: rereads merged and returns idempotent
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
-   "status": "merged",
+   "status": "executing",

[Killed] ConditionalExpression
modules/crm/services/duplicate-execution-service.ts:237:9
   } else {
     // ── Mark failed with CAS ───────────────────────────────────────────────
     const failed = await markSuggestionFailed(id, ctx.clinicId, mergeOperationKey, 'owner_merge_failed');
-    if (!failed) {
+    if (false) {
       // Failure CAS lost — reread to determine outcome
       const updated = await findSuggestionById(ctx.clinicId, id);
killedBy: CRM duplicate execution failure CAS loss: rereads merged and returns idempotent
statusReason: ActionError: Falha na execução do merge pelo owner.

[Killed] BooleanLiteral
modules/crm/services/duplicate-execution-service.ts:237:9
   } else {
     // ── Mark failed with CAS ───────────────────────────────────────────────
     const failed = await markSuggestionFailed(id, ctx.clinicId, mergeOperationKey, 'owner_merge_failed');
-    if (!failed) {
+    if (failed) {
       // Failure CAS lost — reread to determine outcome
       const updated = await findSuggestionById(ctx.clinicId, id);
killedBy: CRM duplicate execution failure CAS loss: rereads merged and returns idempotent
statusReason: ActionError: Falha na execução do merge pelo owner.

[Killed] ObjectLiteral
modules/crm/services/duplicate-execution-service.ts:241:16
       // Failure CAS lost — reread to determine outcome
       const updated = await findSuggestionById(ctx.clinicId, id);
       if (updated?.status === 'merged') {
-        return { id, status: 'merged' };
+        return {};
       }
       throw new ActionError('conflict', 'Concorrência: estado alterado antes de registrar falha.');
killedBy: CRM duplicate execution failure CAS loss: rereads merged and returns idempotent
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 3
+ Received  + 1

- Object {
-   "status": "merged",
- }

[Killed] StringLiteral
modules/crm/services/duplicate-execution-service.ts:241:30
       // Failure CAS lost — reread to determine outcome
       const updated = await findSuggestionById(ctx.clinicId, id);
       if (updated?.status === 'merged') {
-        return { id, status: 'merged' };
+        return { id, status: "" };
       }
       throw new ActionError('conflict', 'Concorrência: estado alterado antes de registrar falha.');
killedBy: CRM duplicate execution failure CAS loss: rereads merged and returns idempotent
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
-   "status": "merged",
+   "status": "",

[Killed] StringLiteral
modules/crm/services/duplicate-execution-service.ts:245:27
       }
       throw new ActionError('conflict', 'Concorrência: estado alterado antes de registrar falha.');
     }
-    throw new ActionError('internal', 'Falha na execução do merge pelo owner.');
+    throw new ActionError("", 'Falha na execução do merge pelo owner.');
   }
 
killedBy: CRM duplicate execution dispatcher error → marks failed and throws internal
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 2
+ Received  + 1

  Object {
-   "code": "internal",
-   "message": "Falha na execução do merge pelo owner.",

[Killed] StringLiteral
modules/crm/services/duplicate-execution-service.ts:245:39
       }
       throw new ActionError('conflict', 'Concorrência: estado alterado antes de registrar falha.');
     }
-    throw new ActionError('internal', 'Falha na execução do merge pelo owner.');
+    throw new ActionError('internal', "");
   }
 
killedBy: CRM duplicate execution dispatcher error → marks failed and throws internal
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 1
+ Received  + 0

  Object {
    "code": "internal",
-   "message": "Falha na execução do merge pelo owner.",

[Killed] StringLiteral
modules/crm/services/duplicate-execution-service.ts:248:24
     throw new ActionError('internal', 'Falha na execução do merge pelo owner.');
   }
 
-  return { id, status: 'executing' };
+  return { id, status: "" };
 }
 
killedBy: CRM duplicate execution normal flow: dispatcher succeeds, finalize wins
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
-   "status": "executing",
+   "status": "",
