[Killed] BlockStatement
modules/financeiro/services/installment-service.ts:31:36
 export async function replaceInstallments(
   budgetId: string,
   installments: InstallmentInput[],
-): Promise<BudgetInstallmentRow[]> {
-  if (installments.length === 0) return [];
-
-  return replaceInstallmentsAtomic(
-    budgetId,
-    installments.map(inst => ({
-      budgetId,
-      amount: String(inst.amount),
-      dueDate: inst.dueDate,
-      status: 'pending',
-    })),
-  );
-}
+): Promise<BudgetInstallmentRow[]> {}
 
 /**
killedBy: replaceInstallments returns empty array when installments input is empty
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] ConditionalExpression
modules/financeiro/services/installment-service.ts:32:7
   budgetId: string,
   installments: InstallmentInput[],
 ): Promise<BudgetInstallmentRow[]> {
-  if (installments.length === 0) return [];
+  if (false) return [];
 
   return replaceInstallmentsAtomic(
killedBy: replaceInstallments returns empty array when installments input is empty
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] EqualityOperator
modules/financeiro/services/installment-service.ts:32:7
   budgetId: string,
   installments: InstallmentInput[],
 ): Promise<BudgetInstallmentRow[]> {
-  if (installments.length === 0) return [];
+  if (installments.length !== 0) return [];
 
   return replaceInstallmentsAtomic(
killedBy: replaceInstallments returns empty array when installments input is empty
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] ArrowFunction
modules/financeiro/services/installment-service.ts:36:22
 
   return replaceInstallmentsAtomic(
     budgetId,
-    installments.map(inst => ({
-      budgetId,
-      amount: String(inst.amount),
-      dueDate: inst.dueDate,
-      status: 'pending',
-    })),
+    installments.map(() => undefined),
   );
 }
killedBy: replaceInstallments delegates to atomic repo with mapped data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "9d79f617-cbbe-4e0c-9c39-a219e25b576e",
  Array [
-   Object {

[Killed] ObjectLiteral
modules/financeiro/services/installment-service.ts:36:31
 
   return replaceInstallmentsAtomic(
     budgetId,
-    installments.map(inst => ({
-      budgetId,
-      amount: String(inst.amount),
-      dueDate: inst.dueDate,
-      status: 'pending',
-    })),
+    installments.map(inst => ({})),
   );
 }
killedBy: replaceInstallments delegates to atomic repo with mapped data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "96bc9679-d07e-4d32-bbe9-98aa5db85d7b",
  Array [
-   Object {

[Killed] BlockStatement
modules/financeiro/services/installment-service.ts:48:91
 /**
  * List installments for a budget.
  */
-export async function listInstallments(budgetId: string): Promise<BudgetInstallmentRow[]> {
-  return repoList(budgetId);
-}
+export async function listInstallments(budgetId: string): Promise<BudgetInstallmentRow[]> {}
 
 /**
killedBy: listInstallments delegates to repo
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": "e91ca805-1767-45bd-a560-01327a0a3be6"}]
Received: undefined

[Killed] BlockStatement
modules/financeiro/services/installment-service.ts:57:84
  * Formula: finalValue - sum of settled payments.
  * Returns 0 if budget not found.
  */
-export async function calculateRemainingBalance(budgetId: string): Promise<number> {
-  const budget = await repoGetBudget(budgetId);
-  if (!budget) return 0;
-
-  const finalValue = parseFloat(budget.finalValue ?? '0');
-  const payments = await repoListPayments(budgetId);
-  const paidTotal = payments.reduce((sum, p) => sum + parseFloat(p.amount), 0);
-
-  return Math.max(0, Math.round((finalValue - paidTotal) * 100) / 100);
-}
+export async function calculateRemainingBalance(budgetId: string): Promise<number> {}
 
 /**
killedBy: calculateRemainingBalance returns 0 when budget is not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BooleanLiteral
modules/financeiro/services/installment-service.ts:59:7
  */
 export async function calculateRemainingBalance(budgetId: string): Promise<number> {
   const budget = await repoGetBudget(budgetId);
-  if (!budget) return 0;
+  if (budget) return 0;
 
   const finalValue = parseFloat(budget.finalValue ?? '0');
killedBy: calculateRemainingBalance returns 0 when budget is not found
statusReason: TypeError: Cannot read properties of null (reading 'finalValue')

[Killed] ConditionalExpression
modules/financeiro/services/installment-service.ts:59:7
  */
 export async function calculateRemainingBalance(budgetId: string): Promise<number> {
   const budget = await repoGetBudget(budgetId);
-  if (!budget) return 0;
+  if (true) return 0;
 
   const finalValue = parseFloat(budget.finalValue ?? '0');
killedBy: calculateRemainingBalance calculates remaining balance correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 349.5
Received: 0

[Killed] LogicalOperator
modules/financeiro/services/installment-service.ts:61:33
   const budget = await repoGetBudget(budgetId);
   if (!budget) return 0;
 
-  const finalValue = parseFloat(budget.finalValue ?? '0');
+  const finalValue = parseFloat(budget.finalValue && '0');
   const payments = await repoListPayments(budgetId);
   const paidTotal = payments.reduce((sum, p) => sum + parseFloat(p.amount), 0);
killedBy: calculateRemainingBalance returns 0 when budget finalValue is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: NaN

[Killed] StringLiteral
modules/financeiro/services/installment-service.ts:61:54
   const budget = await repoGetBudget(budgetId);
   if (!budget) return 0;
 
-  const finalValue = parseFloat(budget.finalValue ?? '0');
+  const finalValue = parseFloat(budget.finalValue ?? "");
   const payments = await repoListPayments(budgetId);
   const paidTotal = payments.reduce((sum, p) => sum + parseFloat(p.amount), 0);
killedBy: calculateRemainingBalance returns 0 when budget finalValue is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: NaN

[Killed] ArrowFunction
modules/financeiro/services/installment-service.ts:63:37
 
   const finalValue = parseFloat(budget.finalValue ?? '0');
   const payments = await repoListPayments(budgetId);
-  const paidTotal = payments.reduce((sum, p) => sum + parseFloat(p.amount), 0);
+  const paidTotal = payments.reduce(() => undefined, 0);
 
   return Math.max(0, Math.round((finalValue - paidTotal) * 100) / 100);
killedBy: calculateRemainingBalance calculates remaining balance correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 349.5
Received: NaN

[Killed] ArithmeticOperator
modules/financeiro/services/installment-service.ts:63:49
 
   const finalValue = parseFloat(budget.finalValue ?? '0');
   const payments = await repoListPayments(budgetId);
-  const paidTotal = payments.reduce((sum, p) => sum + parseFloat(p.amount), 0);
+  const paidTotal = payments.reduce((sum, p) => sum - parseFloat(p.amount), 0);
 
   return Math.max(0, Math.round((finalValue - paidTotal) * 100) / 100);
killedBy: calculateRemainingBalance calculates remaining balance correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 349.5
Received: 650.5

[Killed] ArithmeticOperator
modules/financeiro/services/installment-service.ts:65:34
   const payments = await repoListPayments(budgetId);
   const paidTotal = payments.reduce((sum, p) => sum + parseFloat(p.amount), 0);
 
-  return Math.max(0, Math.round((finalValue - paidTotal) * 100) / 100);
+  return Math.max(0, Math.round((finalValue + paidTotal) * 100) / 100);
 }
 
killedBy: calculateRemainingBalance calculates remaining balance correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 349.5
Received: 650.5

[Killed] ArithmeticOperator
modules/financeiro/services/installment-service.ts:65:33
   const payments = await repoListPayments(budgetId);
   const paidTotal = payments.reduce((sum, p) => sum + parseFloat(p.amount), 0);
 
-  return Math.max(0, Math.round((finalValue - paidTotal) * 100) / 100);
+  return Math.max(0, Math.round((finalValue - paidTotal) / 100) / 100);
 }
 
killedBy: calculateRemainingBalance calculates remaining balance correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 349.5
Received: 0.03

[Killed] BlockStatement
modules/financeiro/services/installment-service.ts:71:93
 /**
  * Get a single installment.
  */
-export async function getInstallment(id: string): Promise<BudgetInstallmentRow | undefined> {
-  return repoGet(id);
-}
+export async function getInstallment(id: string): Promise<BudgetInstallmentRow | undefined> {}
 
 /**
killedBy: getInstallment delegates to repo
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"id": "a3fe0c41-6628-419a-81c5-5b790de2b64a"}
Received: undefined

[Killed] BlockStatement
modules/financeiro/services/installment-service.ts:81:46
 export async function updateInstallment(
   id: string,
   patch: Partial<Pick<BudgetInstallmentRow, 'amount' | 'dueDate' | 'status' | 'paidAt'>>,
-): Promise<BudgetInstallmentRow | undefined> {
-  return repoUpdate(id, patch as Partial<BudgetInstallmentRow>);
-}
+): Promise<BudgetInstallmentRow | undefined> {}
 
 /**
killedBy: updateInstallment delegates to repo with patch
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"amount": "150.00", "id": "8b548b29-c400-4809-a7a9-08ee8fad3833"}
Received: undefined

[Killed] BlockStatement
modules/financeiro/services/installment-service.ts:88:68
 /**
  * Delete a single installment.
  */
-export async function deleteInstallment(id: string): Promise<void> {
-  await repoDelete(id);
-}
+export async function deleteInstallment(id: string): Promise<void> {}
 
killedBy: deleteInstallment delegates to repo
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "e51b8ef2-c433-4e9e-a7dd-b0644563bd47"

Number of calls: 0
